[
  {
    "id": "W8182026",
    "propertyName": "#36 -145 LONG BRANCH AVE",
    "buildingType": "Row / Townhouse",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M8W0A9",
    "price": 998500,
    "bedrooms": 3,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Spring fever hits hard at Longbranch. Almost 1,300 sq. ft, 3 bed and bath, 2-level corner unit with a killer wraparound veranda will make you long for spending balmy summer nights on the large terrace. Way beyond your typical starter home, this townhome is one you can grow into. Plan a future in this distinctly modern and southwest-facing, open-concept floor plan that allows you to use the extra bedrooms for an office or home gym",
    "search_frequency": 0
  },
  {
    "id": "W8182024",
    "propertyName": "#TH-5 -110 VARNA DR",
    "buildingType": "Row / Townhouse",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M6A0C8",
    "price": 868000,
    "bedrooms": 3,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Yorkdale Condos ! Stunning 2-Storey Townhouse with 2 Bedroom Plus Den",
    "search_frequency": 0
  },
  {
    "id": "W8181996",
    "propertyName": "#410 -36 ZORRA ST",
    "buildingType": "Apartment",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M8Z0G5",
    "price": 699999,
    "bedrooms": 1,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "Welcome to 36 Zorra, where luxury and convenience converge. This stunning 4th-floor unit features a spacious 1 bedroom with an Ensuite, a versatile den, in-unit laundry, and underground parking. Enjoy a generous balcony space and access to amenities including an outdoor pool, BBQ area, fire pits, exercise area, games/rec room, and more. Conveniently situated near Costco, movie theaters, shopping, highways, and transit, 36 Zorra offers the ultimate urban lifestyle experience.",
    "search_frequency": 0
  },
  {
    "id": "W8181966",
    "propertyName": "12 BRITANNIA AVE",
    "buildingType": "House",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M6N3T7",
    "price": 1479000,
    "bedrooms": 4,
    "bathrooms": 4,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Be the first to inhabit this immaculate renovated designer home in The Junction meticulously crafted from the studs. Experience seamless modern living with every detail thoughtfully curated for comfort and elegance. Upon entry, be greeted by an airy open-concept layout, bathed in natural light, complemented by exquisite wide plank flooring. The gourmet kitchen, a haven for culinary enthusiasts, features high-end stainless steel appliances, quartz countertops \u0026 bespoke cabinetry, ideal for both intimate gatherings \u0026 lively soires. Retreat to the generously sized primary suite, complete with expansive built-in closets \u0026 a luxurious ensuite bath. Step outside to your private fenced backyard oasis, adorned with tastefully laid patio stones \u0026 a lush garden - a serene escape for alfresco dining \u0026 summer gatherings. Located in a tranquil urban neighborhood, just steps away from parks, dining, shopping local breweries; offering the perfect blend of sophistication \u0026 convenience**** EXTRAS **** City permit for complete back to studs renovation/extension/basement lowering closed 21st March 2024. New everything! Roof, windows, 200Amp elec, plumbing, spray foam insulation, on demand hot water, furnace/Ac, appliances, walls, floors",
    "search_frequency": 0
  },
  {
    "id": "W8181918",
    "propertyName": "#12 -444 SILVERSTONE DR W",
    "buildingType": "Row / Townhouse",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M9V3K8",
    "price": 749000,
    "bedrooms": 4,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Attention All buyers /Investors! Location! Location! Location ! 3 + 1 Brm, 2-Storey Townhouse. Bright Living/Dining Rooms With Walk/Out To Enclosed Patio. Portlights Thru The Main Floor. Modern Kitchen With Quartz Counter Top, Built-In Dishwasher \u0026 modern SS Appliances. Laminate \u0026 Ceramic Floors. Fished Basement for entertainment, Laundry Rm With Front Washer \u0026 Dryer. Underground Parking. Easy Access To Hwys. Close To Shopping, Schools, Transit, Humber Hospital \u0026 Humber College.**** EXTRAS **** All Elf\u0027s \u0026 SS Appliances, Windows covering and Blinds, Unit Located At South East Corner Of Albion \u0026 Silverstone**",
    "search_frequency": 0
  },
  {
    "id": "C8181992",
    "propertyName": "#3208 -955 BAY ST",
    "buildingType": "Apartment",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M5S0C6",
    "price": 1488000,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "In The Heart Of Toronto Bay St Corridor--955 Britt Condos--Luxury Meets Convenience. 1 Parking Included. Offering Close To 1000Sf Of Ample Living Space, This 3 Bed And 2 Bath Corner Unit Is The Perfect Place For You To Call Home. Step Into The Unit And Be Captivated By The Modern Kitchen, Complete With Built-In Appliances. You Will Appreciate The Breathtaking Unobstructed Views Of The City As You Look Out From Your Large Balcony. Location Is Key And This Condo Is Perfectly Situated. Steps Away From Wellesley Subway Station, U Of T, TMU, Queen\u0027s Park, Hospitals, Grocery Stores, Restaurants \u0026 Much More! This Exceptional Unit Definitely Won\u0027t Last!",
    "search_frequency": 0
  },
  {
    "id": "C8181984",
    "propertyName": "#204 -1785 EGLINTON AVE E",
    "buildingType": "Row / Townhouse",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M4A2Y6",
    "price": 625000,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "This Stunning",
    "search_frequency": 0
  },
  {
    "id": "C8182002",
    "propertyName": "141 CHRISTIE ST",
    "buildingType": "House",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M6G3B3",
    "price": 1880000,
    "bedrooms": 5,
    "bathrooms": 6,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Welcome to 141 Christie St, a rarely found gem in the heart of Toronto. This stunning refurbished home boasts a functional layout with solid hardwood floors throughout, offering both elegance and durability. Step into the open concept kitchen featuring an oversized marble island. The abundance of pot lights illuminates the space, and you will be stunned by the gorgeous glass railings leading up to the 3 bedroom upper floor. Outside, the property\u0027s backyard is adorned with beautiful interlocking, creating a serene outdoor retreat. The convenience of a laneway parking with the potential for extension ensures parking is never a hassle. This property offers a legal finished second unit with a walk-up basement, built with city permits, providing additional living space or rental income potential. The separate apartment spans approximately 600 sqft and features 2 bedrooms, each with its own bath. With two laundry units - one for the main house and one for the downstairs apartment. Located just a stone\u0027s throw away from Christie Park and Christie subway station, convenience and accessibility are unmatched. Whether you\u0027re commuting to work or exploring the vibrant city, everything you need is right at your doorstep.**** EXTRAS **** Fridges, stoves, dishwasher, washer and dryer. All existing light fixtures",
    "search_frequency": 0
  },
  {
    "id": "C8181930",
    "propertyName": "#306 -99 FOXBAR RD",
    "buildingType": "Apartment",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M4V0B2",
    "price": 658388,
    "bedrooms": 1,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "Welcome To The Iconic Blue Diamond Condos In The Heart of Avenue Rd \u0026 St. Clair In One Of The Most Affluent Neighbourhoods in Toronto, Nestled In Forest Hill, Is A Short Walk To Both Yonge St and The St Clair Subway Station. Rare 1 Bedroom Unit With Spectacular Birds Eye Views Of The Newly Developed Luxurious Courtyard. 20,000 Sq Feet Of World Class Amenities At The Imperial Club: Indoor Pool, Hottub, Steam Room, Gym, Yoga Room, Theatre, Squash Courts, Golf Simulator, Games Room, Squash Court. Perfect Place To Come Home To!**** EXTRAS **** Fridge, Stove, Dishwasher and Washer \u0026 Dryer",
    "search_frequency": 0
  },
  {
    "id": "W8181790",
    "propertyName": "35 RONALD AVE",
    "buildingType": "House",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M6E4M5",
    "price": 1420000,
    "bedrooms": 5,
    "bathrooms": 5,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Keep this Stunning Turnkey Income Property",
    "search_frequency": 0
  },
  {
    "id": "W8181656",
    "propertyName": "#850 -30 TANDRIDGE CRES",
    "buildingType": "Row / Townhouse",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M9W2P2",
    "price": 599900,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Great Starter 3 Bedroom Townhouse With Fenced Large Front Yard! Large Bedrooms, 1 Full Bath \u0026 1 Powder Room on Main Floor, Open Concept \u0026 Very Well Maintained. Newly installed carpet. Nestled In A Quite Family Friendly Neighborhood. Sunken Large Living Room With A Walkout To A Very Private Yard. Bright \u0026 Spacious W/Extra Large Windows. Easy Access To Highways Makes Commuting A Breeze. Lovely Place For Relaxing \u0026 Entertaining, Just Steps To Beautiful Parks \u0026 Humber River.**** EXTRAS **** Close To All Amenities, Schools, Parks, Trails, Big Box Stores, Highways 400/401/407 \u0026 So Much More!",
    "search_frequency": 0
  },
  {
    "id": "W8181650",
    "propertyName": "101 LIVINGSTONE AVE",
    "buildingType": "House",
    "city": "Toronto",
    "province": "Ontario",
    "pincode": "M6E2L7",
    "price": 949000,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 0.0,
    "description": "Presenting 101 Livingstone: a well maintained bungalow in Midtown West. This versatile property features a 2-bedroom main level and a 2-bedroom basement in-law suite, ideal for first time buyers, retirement living, or investment. Highlights include hardwood floors, ac unit and furnace, updated kitchen and bath on main, newer roof, stainless steel appliances , detached double garage, and separate basement entrance. Conveniently located near shops, schools, parks, and Eglinton West Station for effortless city access.**** EXTRAS **** Incredible opportunity for your personal touches and improvements including possible Laneway housing conversion for extra income or a complete rebuild. Concept plans available in attachments.",
    "search_frequency": 0
  },
  {
    "id": "24006480",
    "propertyName": "1546-48 CURRY AVENUE",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N9A6Z6",
    "price": 599000,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "THIS CONVENIENTLY LOCATED TURN KEY SIDE BY SIDE DUPLEX WAS PURPOSE BUILT IN 1993 AND IS PRICED TO SELL. EACH IDENTICAL UNIT FEATURES 3 BEDROOMS, 1.5 BATHS, LARGE KITCHEN AND LIVING AREAS. THE BUILDING HAS BEEN METICULOUSLY MAINTAINED WITH FORCED AIR HEATING AND COOLING. EACH UNIT HAS ITS OWN DRIVEWAY. BOTH UNITS ARE CURRENTLY RENTED FOR $850 AND $1825 PER MONTH PLUS UTILITIES. PLEASE ALLOW A MINIMUM OF 24 HOURS FOR ALL SHOWINGS AS PER THE RTA ALL OFFERS MUST BE IRREVOCABLE FOR A MINIMUM OF 48 HOURS.",
    "search_frequency": 0
  },
  {
    "id": "24006548",
    "propertyName": "1552-1554 CURRY AVENUE",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N9B3P1",
    "price": 599000,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "THIS CONVENIENTLY LOCATED TURN KEY SIDE BY SIDE DUPLEX WAS PURPOSE BUILT IN 1993 AND IS PRICED TO SELL. EACH IDENTICAL UNIT FEATURES 3 BEDROOMS, 1.5 BATHS, LARGE KITCHEN AND LIVING AREAS. THE BUILDING HAS BEEN METICULOUSLY MAINTAINED WITH FORECED AIR HEATING AND COOLING. EACH UNIT HAS ITS OWN DRIVEWAY BOTH UNITS ARE CURRENTLY RENTED FOR $875 AND $1000 PER MONTH, PLUS UTILITIES PLEASE ALLOW A MINIMUM OF 24 HOURS BEFORE ALL SHOWINGS AS PER THE RTA. ALL OFFERS MUST BE IRREVOCABLE FOR A MINIMUM OF 48 HOURS.",
    "search_frequency": 0
  },
  {
    "id": "24006550",
    "propertyName": "2214 WELLESLEY AVENUE",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N8W2E9",
    "price": 288000,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 0.0,
    "description": "IDEAL SOUTH WALKERVILLE LOCATION WELLESLEY STREET BETWEEN YPRES \u0026 LENS AND CLOSE TO ALL CONVENIENCES. POTENTIAL SEPARATE BACK ENTRY TO THE BASEMENT. ALL BIG-TICKET ITEMS UPGRADED IN THE LAST FIVE-TEN YEARS. NEW ENERGY EFFICIENT FURNACE \u0026 CENTRAL AIR WITH HIGH END HVAC AIR CLEANER",
    "search_frequency": 0
  },
  {
    "id": "24006546",
    "propertyName": "11924 MAITLAND",
    "buildingType": "Row / Townhouse",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N8P0B9",
    "price": 579900,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "Bright, spacious porcelain tiled foyer, handsome engineered hardwood floors on main, tray ceiling with recessed lighting. Tall upgraded cabinets, quartz counter tops in kitchen and 8 foot patio doors to 10x12 deck for outdoor entertaining. 2 good sized bedrooms w/walk in closets. Private primary bedroom on second floor with glass shower ensuite bath. Basement is framed and ready for you to complete as you like. Cat 5 wired home great for streaming. Call for immediate details!",
    "search_frequency": 0
  },
  {
    "id": "24006544",
    "propertyName": "2288 CADILLAC",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N8W3Y1",
    "price": 599900,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "WELCOME TO 2288 CADILLAC! THIS CHARMING BACK SPLIT 4 LEVEL FEATURES 3 NICE SIZED BEDROOMS, 2 BATHS, SPACIOUS LIVING ROOM AND BASEMENT AREA FOR BIG FAMILES. THE KITCHEN OFFERS SOFT CLOSE CABINETS AND APPLIANCES. THE FAMILY ROOM HAS A COZY FIREPLACE AND WETBAR, PERFECT FOR THOSE GATHERINGS. A SPECIAL FEATURE INCLUDES A HANDYMANS WORKSHOP WITH POWER SITTING ON A FENCED YARD, WITH A MASSIVE DRIVEWAY THAT FITS UP TO 10 CARS. DONT MISS OUT ON THIS HOME! BOOK YOUR PRIVATE SHOWING!",
    "search_frequency": 0
  },
  {
    "id": "24006479",
    "propertyName": "3095 FAZIO DRIVE",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N9E4C3",
    "price": 699900,
    "bedrooms": 4,
    "bathrooms": 3,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "THIS STUNNING 5-LEVEL SIDE SPLIT ON A CORNER LOT, IN THE DESIRABLE SPRING GARDENS AREA BOASTS A TON OF ATTRACTIVE FEATURES. WITH 4 SPACIOUS BEDROOMS AND 3 FULL BATHS, IT OFFERS AMPLE SPACE FOR COMFORTABLE LIVING AND IS A GREAT OPTION FOR MULTI GENERATIONAL FAMILIES OR INVESTORS ALIKE. RENOVATED TO PERFECTION, THE HOME SHOWCASES MODERN AMENITIES AND STYLISH FINISHES THROUGHOUT. ITS CONVENIENT LOCATION ENSURES EASY ACCESS TO BOTH THE BRIDGE AND HIGHWAY 3, MAKING COMMUTING A BREEZE. ADDITIONALLY, THE GRADE ENTRANCE PRESENTS AN EXCITING OPPORTUNITY FOR AN IN-LAW SUITE, ADDING VERSATILITY AND POTENTIAL TO THIS ALREADY IMPRESSIVE PROPERTY.",
    "search_frequency": 0
  },
  {
    "id": "24006541",
    "propertyName": "2609 PILLETTE ROAD",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N8T1P9",
    "price": 599999,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1000.0,
    "description": "Welcome to the craftsmanship of Supreme homes. Have you been looking for a new build that is attainable? Look no further...This home offers value, craftsmanship and customizability! Supreme Homes is giving you the opportunity to choose your finishes, flooring, interior colours and much more! This 2 bedroom, 2 bathroom raised ranch semi-detached with a full basement with a walk-out",
    "search_frequency": 0
  },
  {
    "id": "24006529",
    "propertyName": "3426 HOWARD AVENUE",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N9E3N5",
    "price": 649900,
    "bedrooms": 3,
    "bathrooms": 1,
    "numberOfStoreys": 1.0,
    "sqft": 0.0,
    "description": "ATTENTION INVESTORS. Discover this charming 3-bedroom, 1-bath home in the desirable South Windsor area, boasting a spacious 61-foot frontage and 740 deep lot, hard to find 1 acre in middle of south Windsor. Perfectly located close to the mall and all amenities for unmatched convenience. Ideal for those seeking a blend of comfort and easy access to shopping, dining, and entertainment.",
    "search_frequency": 0
  },
  {
    "id": "24006533",
    "propertyName": "475 GILES West",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N9A6H7",
    "price": 299000,
    "bedrooms": 3,
    "bathrooms": 1,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "THIS 2 STOREY FULL BRICK HAS RD 2.2 ZONING ALLOWING UP TO A 4PLEX THAT COULD EASILY BE CONVERTED PLUS A SIDE DRIVE WITH A 1 CAR GARAGE. FRESHLY PAINTED WITH A NEW KITCHEN AND NEW MAIN FLOORING. OPPORTUNITY AWAITS!!",
    "search_frequency": 0
  },
  {
    "id": "24006538",
    "propertyName": "980 MAISONVILLE AVENUE",
    "buildingType": "No Building",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N8Y3S4",
    "price": 149900,
    "bedrooms": 0,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "BUILD YOUR INCOME HOME, FANTASTIC OPPORTUNITY TO BEAT THE RUSH WITH THOUSANDS OF DOLLARS IN CITY OF WINDSOR INCENTIVES. THIS LOCATION IS PRIME IN FORD CITY AND IS NEXT TO A PARKING LOT. ONE STREET OFF OF THE MAIN HUB",
    "search_frequency": 0
  },
  {
    "id": "24006535",
    "propertyName": "984 ELLROSE AVENUE",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N8Y3W9",
    "price": 524900,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 0.0,
    "description": "This charming, extremely clean duplex offers a great investment opportunity or for home owners looking for a renovated home offering extra income. Many updates in both 2 bedroom units with dining areas, kitchens, family rooms, a 3 and 4 pce baths with shared laundry. Main has a lovely enclosed front porch for those beautiful sunny days. Enjoy the convenience of front and back parking with a garage in back. Located near schools, medical, shopping, bus routes, etc and a 10 minute walk to Pillette Park on the river.",
    "search_frequency": 0
  },
  {
    "id": "24006519",
    "propertyName": "810 ASSUMPTION",
    "buildingType": "House",
    "city": "Windsor",
    "province": "Ontario",
    "pincode": "N9A3B8",
    "price": 584900,
    "bedrooms": 7,
    "bathrooms": 5,
    "numberOfStoreys": 1.75,
    "sqft": 0.0,
    "description": "ATTENTION INVESTORS!! SPRING IS HERE SO do explore this opportunity. HOME offers 5+2 Bedrooms, 4+1 bathrooms, 1+1 Kitchens, East side very convenient location, Buses, Downtown, Casino, walk to Riverfront, many possibilities to rent out, with projected Gross income from $4000 to $5000, per month. New Sump pump with back up water valve, Newer Washer Dryer, fridge, All Rooms are furnished and have TVs. Currently rented but vacant possession can be provided if needed. Three bedrooms have ensuite 3 PC bathrooms for privacy and convenience. Priced to sell. Fenced backyard for privacy. Owner enjoyed the property and looking for larger units.",
    "search_frequency": 0
  },
  {
    "id": "27124584",
    "propertyName": "9950 Place de l\u0027Acadie #1075",
    "buildingType": "Apartment",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H4N0C9",
    "price": 349000,
    "bedrooms": 1,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 602.0,
    "description": "Beautiful condo in the Cite Signature project! Enjoy a bright open concept living space with large floor to ceiling windows, spacious bedroom, bathroom with seperate shower and bath, garage and locker space included. Gym and roof top terrasse with BBQ and Jacuzzi. Centrally located close to all services and amenities, public transportation, schools, parks, highways and more. A MUST SEE!",
    "search_frequency": 0
  },
  {
    "id": "25787317",
    "propertyName": "5609 16e Avenue",
    "buildingType": "Apartment",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H1X2S7",
    "price": 898000,
    "bedrooms": 3,
    "bathrooms": 3,
    "numberOfStoreys": 0.0,
    "sqft": 1486.0,
    "description": "Townhouse with garage located in the Vieux-Rosemont sector. Open living space on the ground floor surrounded by multiple windows. 2 bedrooms on the 2nd floor and 1 on the 3rd floor. Renovated bathroom. Laundry room in the basement with access to the garage. Rear terrace. Ready to move in!",
    "search_frequency": 0
  },
  {
    "id": "19667856",
    "propertyName": "1310 Rue St-Louis",
    "buildingType": "House",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H4L2P3",
    "price": 699000,
    "bedrooms": 5,
    "bathrooms": 2,
    "numberOfStoreys": 2.0,
    "sqft": 1330.0,
    "description": "See listing broker",
    "search_frequency": 0
  },
  {
    "id": "18718151",
    "propertyName": "4900 Boul. Cavendish",
    "buildingType": "House",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H4V2R3",
    "price": 1110000,
    "bedrooms": 5,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 2568.0,
    "description": "Semi-detached well maintained large house located in a sought-after residential area of cote des neige. Close to daycares, elementary school, high school, and Concordia campus. One minutes of walk to bus station 104, 138, 420, 51, 102. This house is well maintained by the owner. It has 5 closed bedrooms and 3 full bathrooms, finished basement and a double garage will charm you with its entirely brick wall covering. The kitchen opens onto a large balcony leading to an intimate fenced courtyard. The basement, with its two closed bedrooms, one full bathroom, one family room and second living room. MUST SEE",
    "search_frequency": 0
  },
  {
    "id": "11714095",
    "propertyName": "1239 Rue Drummond #508",
    "buildingType": "Apartment",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H3G0B6",
    "price": 429000,
    "bedrooms": 1,
    "bathrooms": 1,
    "numberOfStoreys": 22.0,
    "sqft": 480.0,
    "description": "Stunning condo 2020 construction located in the Heart of Downtown Montreal, walking distance from all services. Open air concept with modern quality materials including a signature �scavolini� kitchen. Huge windows overlooking the south side of the City with a breathtaking view.Rooftop pool with lounge \u0026 BBQ area, 2 level gym,high speed elevators.Please respect 48 hours notice. The tenant will leave by 2024 May 31st.",
    "search_frequency": 0
  },
  {
    "id": "9686711",
    "propertyName": "7299 Rue Chouinard",
    "buildingType": "Apartment",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H8N3C7",
    "price": 510000,
    "bedrooms": 2,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 1276.0,
    "description": "Nestled in a tranquil section in LaSalle, on the top floor of a quaint three-unit building. Enjoy an open concept of living space, two bedrooms with one generously sized bathroom and a spacious balcony. Access to the private garage is seamless from within the unit, complemented by readily available street parking. Within walking distance lie the metro station, Le Carrefour Angrignon, Angrignon park. Close to all the services and amenities. Do not miss it.",
    "search_frequency": 0
  },
  {
    "id": "27266305",
    "propertyName": "555 Rue de la Commune O. #506",
    "buildingType": "Apartment",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H3C5X5",
    "price": 915000,
    "bedrooms": 2,
    "bathrooms": 1,
    "numberOfStoreys": 9.0,
    "sqft": 1165.0,
    "description": "QUAI DE LA COMMUNE phase 3, urban condo/loft, sun-filled, 10\u0027 concrete ceilings, wood floors, open living area, kitchen with central island and high-end appliances, two bedrooms including master with ensuite bathroom, central air conditioning and heating, storage locker and garage. Magnificent shared rooftop terrace with breathtaking views.",
    "search_frequency": 0
  },
  {
    "id": "25764670",
    "propertyName": "4965 Ch. de la C�te-St-Luc",
    "buildingType": "Multi-Family",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H4W3H6",
    "price": 8600000,
    "bedrooms": 5,
    "bathrooms": 4,
    "numberOfStoreys": 3.0,
    "sqft": 0.0,
    "description": "Unique opportunity to acquire a building of 23 completely renovated units! A high-end property with a total of 15 x 4 1/2 as well as 8 x 3 1/2. An exceptional location in NDG, close to Westmount and only a few minutes from Downtown Montreal. You will also find a roof terrace, accessible to tenants, with a breathtaking view . A real opportunity to acquire a building strategically located in one of the most sought-after areas in town which will continue to increase in value year after year. Take advantage of a stabilized building with an impressive net revenue of $352,600! GST/QST must be added to the asking price",
    "search_frequency": 0
  },
  {
    "id": "22059669",
    "propertyName": "6375 Rue de Marseille",
    "buildingType": "Triplex",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H1N1L5",
    "price": 779000,
    "bedrooms": 3,
    "bathrooms": 1,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Occasion unique d\u0027acqu�rir ce joli triplex. Ses trois unit�s ont trois chambres � coucher",
    "search_frequency": 0
  },
  {
    "id": "20765912",
    "propertyName": "1002 Rue Jacqueline-Sicotte",
    "buildingType": "Row / Townhouse",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H8N0G3",
    "price": 999000,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1882.0,
    "description": "Superb modern townhome in sought after La VIDA LaSalle. A perfect layout over 4 floors, this 4 bedroom home with custom finishes features an open concept main floor with huge private terrace. Primary suite on the second floor with luxurious bath, office/gym and balcony, 3rd floor features 2 large bedrooms and big family bath, balcony and walk in closet... Finished basement with family room, private 2 car garage and laundry.",
    "search_frequency": 0
  },
  {
    "id": "20486317",
    "propertyName": "85 Rue D\u0027Argenson",
    "buildingType": "House",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H1B1G9",
    "price": 475000,
    "bedrooms": 3,
    "bathrooms": 1,
    "numberOfStoreys": 2.0,
    "sqft": 0.0,
    "description": "Propri�t� bien entretenue au fils des ans. 3 chambres � l\u0027�tage, bel espace de vie, tr�s lumineux, majoritairement planchers de bois francs et de c�ramique, cuisine fonctionnelle avec �lot, armoires de bois, comptoir de quartz, �vier double, salle d\u0027eau et de lavage adjacente � la cuisine, O\u0027gee au rdc et 2e �tage, tr�s grande chambre principale",
    "search_frequency": 0
  },
  {
    "id": "17949562",
    "propertyName": "2700 Rue de Bruxelles",
    "buildingType": "House",
    "city": "Montreal",
    "province": "Quebec",
    "pincode": "H1L6A1",
    "price": 469000,
    "bedrooms": 2,
    "bathrooms": 1,
    "numberOfStoreys": 1.0,
    "sqft": 0.0,
    "description": "� 10 minutes � pied du m�tro Honor�-Beaugrand ! Petite maison coquette avec 2 chambres-�-coucher, salon/cuisine � aire ouverte et sortie vers l\u0027arri�re et le cabanon. La salle de bain inclut l\u0027espace de lavage et l\u0027acc�s vers le vide sanitaire. � l\u0027ext�rieur, la maison dispose d\u0027un grand terrain en avant, entour� de haie et d\u0027arbres feuillus et d\u0027une haute haie de c�dre en arri�re. Acc�s � la maison par la rue Pierre-de-Coubertin. OCCUPATION IMM�DIATE.",
    "search_frequency": 0
  },
  {
    "id": "E4379367",
    "propertyName": "10646 67 AV NW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T6H1Z8",
    "price": 440000,
    "bedrooms": 5,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 1080.0,
    "description": "LEGAL BASEMENT SUITE! Looking for a great income property? This home is perfect for a couple or young family looking for a home and income suite in one. Featuring an updated kitchen complete with a pantry and a spice cabinet, with 3 bedrooms up and 2 bedrooms plus den in the basement suite. Located in the convenient and desirable neighborhood of Allendale, this home is a quick 8 minute drive to Downtown and the University.",
    "search_frequency": 0
  },
  {
    "id": "E4379368",
    "propertyName": "11172 83 AV NW",
    "buildingType": "Row / Townhouse",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T6V0V1",
    "price": 334934,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1005.0,
    "description": "LOCATION! 5 min walk to the U of A, LRT, Shops, Restaurants, Banks, bars and the river valley trails. RARE 3 bedroom, 1.5 bathrooms, even a flex space for a study and a bonus loft area! AMAZING natural light thoughout thanks to the unique design with vaulted ceilings and clerestory windows throughout! HEATED undeground parking stall is TITLED, no worries about your spot being reassinged, you own it! Kitchen with room for a table and bar stools for added seating. As you walk through, imagine yourself in the space, relaxing, studying, or soaking up the natural light. No cookie cutter condo here, the design and layout of this unit is so unique and spacious. A must see.",
    "search_frequency": 0
  },
  {
    "id": "E4379365",
    "propertyName": "#320 12550 140 AV NW",
    "buildingType": "Apartment",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5X6J4",
    "price": 169999,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 886.0,
    "description": "Welcome to this lovely 2-bedroom apartment with two full baths. The Unit has a balcony with a nice view, Parks, shopping stores and playgrounds are nearby. The building is quiet and clean. The kitchen offers plenty of cabinets with an open concept. The primary bedroom has a walk-in closet and a 4pc ensuite bathroom. The secondary bedroom is generous in size and located on the other side of the living room. This unit has NO carpet. There is One outdoor parking stall. No pets as per condo bylaws. Great location close to shopping, schools, parks, restaurants and public transit. It is located directly across the street to grocery stores Great for first time home buyer!",
    "search_frequency": 0
  },
  {
    "id": "E4379366",
    "propertyName": "8919 137 AV NW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5E1Y3",
    "price": 388800,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 840.0,
    "description": "3+1 Bedrooms, TWO KITCHENS AND SEPARATE SIDE ENTRANCE TO THE FULLY FINISHED BASEMENT. located on large lot",
    "search_frequency": 0
  },
  {
    "id": "E4379358",
    "propertyName": "229 MARQUIS BV NE",
    "buildingType": "Row / Townhouse",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5Y3K7",
    "price": 319998,
    "bedrooms": 2,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 1100.0,
    "description": "NO CONDO FEES and AMAZING VALUE! You read that right welcome to this brand new townhouse unit the Demi Built by StreetSide Developments and is located in one of Edmonton\u0027s newest premier North East communities of Marquis. With almost 1100 square Feet, it comes with front yard landscaping and a single over sized attached garage, this opportunity is perfect for a young family or young couple. Your main floor is complete with upgrade luxury Vinyl Plank flooring throughout the great room and the kitchen. The main entrance/ main floor has a large sized foyer with a 2 piece bathroom. Highlighted in your new kitchen are upgraded cabinets, upgraded counter tops and a tile back splash. The upper level has 2 bedrooms and 2 full bathrooms. *** This home is under constriction and the photos used are of the show home, the colors and finishings may vary *** This home will be completed by August***",
    "search_frequency": 0
  },
  {
    "id": "E4379361",
    "propertyName": "14022 104A AV NW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5N0X9",
    "price": 529900,
    "bedrooms": 3,
    "bathrooms": 3,
    "numberOfStoreys": 1.5,
    "sqft": 1391.0,
    "description": "Prime location: Glenora. The LOT is LARGE at 687 m2",
    "search_frequency": 0
  },
  {
    "id": "E4379362",
    "propertyName": "#13 13119 209 ST NW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5S0N1",
    "price": 449998,
    "bedrooms": 3,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 1376.0,
    "description": "Welcome to StreetSide Developments newest product line the Village at Trumpeter! These detached single family homes give you the opportunity to purchase a brand new single family home for the price of a duplex. These homes are nested in a private community that gives you a village like feeling. There are only a hand full of units in this Village like community which makes it family orientated. From the superior floor plans to the superior designs owning a unique family built home has never felt this good. Located close to all amenities and easy access to major roads like the Henday and Yellowhead trail. A Village fee of 39 per month takes care of your road snow removal so you dont have too. All you have to do is move in and enjoy your new home. *** the photos used are from the exact same model recently built and the photos of the actual will be uploaded shortly!",
    "search_frequency": 0
  },
  {
    "id": "E4379360",
    "propertyName": "22831 84 AV NW",
    "buildingType": "Row / Townhouse",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5T7N9",
    "price": 329998,
    "bedrooms": 2,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 1100.0,
    "description": "NO CONDO FEES and AMAZING VALUE! You read that right welcome to this brand new townhouse unit the Demi Built by StreetSide Developments and is located in one of Edmonton\u0027s newest premier West End communities of Rosnethal. With almost 900 square Feet, it comes with front yard landscaping and a single over sized attached garage, this opportunity is perfect for a young family or young couple. Your main floor is complete with upgrade luxury Vinyl Plank flooring throughout the great room and the kitchen. The main entrance/ main floor has a large sized foyer with a 2 piece bathroom. Highlighted in your new kitchen are upgraded cabinets, upgraded counter tops and a tile back splash. The upper level has 2 bedrooms and 2 full bathrooms. *** Photos are from a previous built home and colors/Finishing\u0027s may vary *** this home will be complete this summer***",
    "search_frequency": 0
  },
  {
    "id": "E4379356",
    "propertyName": "11718 11B AV NW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T6J7E3",
    "price": 619000,
    "bedrooms": 6,
    "bathrooms": 4,
    "numberOfStoreys": 2.0,
    "sqft": 2033.0,
    "description": "Welcome to TWINBROOKS! This fully RENOVATED modern house boasts 6 BEDROOMS and 3.5 BATHROOMS, situated on a 45-foot wide lot, complete with a charming front porch. The main floor features a brand new kitchen equipped with top-of-the-line appliances and fixtures, alongside a living room, family room, dining area, a full bedroom, laundry, and a half bath. Ascend the beautiful curved staircase to discover the primary bedroom with a luxurious 5-piece ensuite, as well as 2 additional bedrooms with a JACK N JILL Washroom. The fully finished basement offers 2 more bedrooms, a full washroom, and another living room. Roof shingles were recently replaced in 2021. Conveniently located near Whitemud Creek with easy access to Anthony Henday.",
    "search_frequency": 0
  },
  {
    "id": "E4379352",
    "propertyName": "3231 ALLAN WY SW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T6W2L8",
    "price": 578900,
    "bedrooms": 3,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 1981.0,
    "description": "Welcome to the desirable community of Ambleside! This meticulously maintained 2 storey home boasts nearly 2000 sqft of living space with 3 beds, 2.5 baths, a large bonus room \u0026 a heated garage! Upon entering the front door you are greeted with a spacious foyer, 9\u0027 high ceilings, a beautiful kitchen with pantry and gas fireplace in the living room. Upstairs has 3 good sized bedrooms including a beautiful primary suite that comes with a large walk-in closet, 5 pc ensuite featuring 2 sinks, corner tub \u0026 separate shower. Upstairs you\u0027ll also find a spacious bonus room with vaulted ceilings, lots of windows and a the upstairs laundry room. The backyard is extra deep and has a large 2 tiered deck, beautiful landscaping, a concrete patio and shed. Come check it out and don\u0027t miss out!",
    "search_frequency": 0
  },
  {
    "id": "E4379353",
    "propertyName": "203 37 ST SW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T6X2W4",
    "price": 759000,
    "bedrooms": 4,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 2481.0,
    "description": "Explore this spacious home on a 28-pocket lot, featuring over 2,480 sq ft of living space with 9 ft ceilings on all floors. The stucco exterior and smart lighting welcome you, alongside two living areas on the main floor and an upstairs bonus room. Highlights include a main floor bedroom with ensuite, a large spice kitchen, and sophisticated black finishes. Experience luxury with built-in appliances, maple wood railings with glass, and an open to above/below design that enhances the home\u0027s spacious feel. Upstairs, find 3 bedrooms, 2 baths, and a master suite with smart lighting, a steam shower, and a 5-pc ensuite. Additional features include huge windows for natural light, MDF shelved closets, central air conditioner, a concrete stamped patio, and a heated garage. The well-maintained yard is ready for the optional addition of a legal 2 bed, bath basement suite for an extra $55,000. Contact VK at 780-277-2277 for details or to book a viewing.",
    "search_frequency": 0
  },
  {
    "id": "E4379355",
    "propertyName": "11437 94 ST NW",
    "buildingType": "House",
    "city": "Edmonton",
    "province": "Alberta",
    "pincode": "T5G1H5",
    "price": 259899,
    "bedrooms": 3,
    "bathrooms": 1,
    "numberOfStoreys": 1.5,
    "sqft": 1217.0,
    "description": "Welcome Home to this character 1.5 story in Alberta Avenue! Spacious front porch, opening to the original foyer. Bright west facing living area with loads of windows, which also used to be open to dining area, now the 3rd bedroom . Upgraded kitchen cabinets with corian countertops, stainless appliances , rear mudroom, leading to open fenced back yard. Second level has 2 generous bedrooms and a main 4 piece bath. Upgrades include, newer furnace, windows, electrical, shingles , and weeping tile and sump pump. Great locaton, close to transportation, restaurants and shopping !",
    "search_frequency": 0
  },
  {
    "id": "R2864124",
    "propertyName": "2831 E BROADWAY",
    "buildingType": "House",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V5M1Y9",
    "price": 3880000,
    "bedrooms": 6,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1960.0,
    "description": "Very Good location. Close to Renfrew Skytrain Station Bus Stop. Shops T\u0026T Supermarket, Superstore Walmart..... Restaurants Coffee Shops. The Developers must see.",
    "search_frequency": 0
  },
  {
    "id": "R2864121",
    "propertyName": "1495 E 20TH AVENUE",
    "buildingType": "House",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V5N2K5",
    "price": 1798000,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 1832.0,
    "description": "Welcome to Cedar Cottage, a family oriented neighbourhood centrally located in East Van. This 4 Bed 2 Bath home is 99 years young, situated on a 33�x 122� RT-10 corner lot. Plumbing and Wiring has been updated throughout as well as new laminate flooring. Fresh exterior paint and new fencing around property. Enjoy views of the North Shore Mountains from the enclosed deck off the kitchen on the Main floor. 2 Beds up at $2686.60 and 2 Beds down at $1995 both Month to Month. Ready made Investment generating over $56k per year or move in with a mortgage helper already in place.",
    "search_frequency": 0
  },
  {
    "id": "R2864118",
    "propertyName": "8192 OSLER STREET",
    "buildingType": "House",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V6P4E2",
    "price": 2199000,
    "bedrooms": 2,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 1539.0,
    "description": "Excellent opportunity for DEVELOPERS or INVESTORS. RTM-8 Zoning: Marpole Community Plan designates Townhouse/Row house with 0.75 FSR. Walking distance to Oak Park, community center, supermarket, restaurants, shops \u0026 public transit. Great school catchment - Sir Winston Churchill Secondary",
    "search_frequency": 0
  },
  {
    "id": "R2864130",
    "propertyName": "7705 RAINTREE COURT",
    "buildingType": "Row / Townhouse",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V5S4A4",
    "price": 1210000,
    "bedrooms": 4,
    "bathrooms": 3,
    "numberOfStoreys": 0.0,
    "sqft": 2112.0,
    "description": "Welcome home to the Woodlands! This beautiful 4 bedroom renovated townhome has over 2100sf on 2 levels and offers spacious living for everyone, located in a popular family friendly neighbourhood. Stay warm and cozy in your living area with wood burning f/p. With 3 bedrooms upstairs and 1 bedroom or den on main, this end unit home feels like a large detached house",
    "search_frequency": 0
  },
  {
    "id": "R2864113",
    "propertyName": "906 8555 GRANVILLE STREET",
    "buildingType": "Apartment",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V6P4Z9",
    "price": 999000,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 997.0,
    "description": "Granville at 70th by Westbank offers a spacious residence with 2 beds, 2 baths plus an additional office/den. Enjoy breathtaking views of the mountains and city from balconies. Equipped with A/C, hardwood flooring and top-of-the-line Miele appliances, and benefits from a 24 hour concierge service for added convenience. Located adjacent to Safeway, daily grocery shopping, banks and parks. Conveniently close to Richmond and the YVR Airport, while downtown can be reached within a 15 minute drive. Families will appreciate the proximity to Dr. R.E. McKechnie Elementary and Magee Secondary schools. Open House 2-4 pm Mar 31.",
    "search_frequency": 0
  },
  {
    "id": "R2864114",
    "propertyName": "606 29 SMITHE MEWS",
    "buildingType": "Apartment",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V6B0B6",
    "price": 1378000,
    "bedrooms": 1,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1092.0,
    "description": "Will update w list of upgrades soon",
    "search_frequency": 0
  },
  {
    "id": "R2864082",
    "propertyName": "7028 OSLER STREET",
    "buildingType": "House",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V6P4C6",
    "price": 4998000,
    "bedrooms": 7,
    "bathrooms": 6,
    "numberOfStoreys": 0.0,
    "sqft": 4570.0,
    "description": "WELCOME HOME to 7028 Osler St.! This 5 Bedrooms up, 2 Bedrooms down, custom built house by a European builder is located in a quiet neighborhood in the heart of Vancouver Westside",
    "search_frequency": 0
  },
  {
    "id": "R2864051",
    "propertyName": "5368 MANSON STREET",
    "buildingType": "House",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V5Z3H1",
    "price": 6888000,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1945.0,
    "description": "Cambie Corridor Phase 3 Land Development Site! Builder Developer ALERT! \u0026 61\u0027 X 138.5\u0027 property close to Queen Elizabeth Park, Oakridge Mall \u0026 transit. Oil tank removed. The property is located in Cambie Phase 3 plan designated for 18 storey high rise development.",
    "search_frequency": 0
  },
  {
    "id": "R2864053",
    "propertyName": "8535 CAPTAINS COVE",
    "buildingType": "House",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V6P6S1",
    "price": 3189000,
    "bedrooms": 3,
    "bathrooms": 5,
    "numberOfStoreys": 0.0,
    "sqft": 2866.0,
    "description": "Captain\u0027s Cove in Angus Lands. Gorgeous, extremely well-maintained house. Enter through a large foyer that flows into a formal living and dining room, open kitchen with plenty of cabinetry, granite counters and an eating area and spacious family room, the French doors onto lush gardens and a stunning heated pool in the centre. The extra large primary bedroom features an ensuite and a private den and two additional bedrooms",
    "search_frequency": 0
  },
  {
    "id": "R2864099",
    "propertyName": "304 350 E 2ND AVENUE",
    "buildingType": "Apartment",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V5T4R8",
    "price": 908000,
    "bedrooms": 1,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 881.0,
    "description": "REFRESHED AND READY for your design! Welcome to MAINSPACE. This industrial concrete/steel loft is zoned as a live/work studio in False Creek Flats. The creative tech/hub of this Mount Pleasant district. Exposed 10\\\" ceilings, nearly 900 sq feet, polished concrete floors, north facing Juliette balcony with city/mountain views, 16\u0027 of wall-to-wall floor to ceiling windows and separate bedroom area. Insuite laundry and shared laundry. Expansive views from the common rooftop deck and a unique common Gallery for resident events. Pets are welcome. A walk score of 99! This community has Olympic Village Chinatown and Strathcona to the north, Main Street to the west, Emily Carr, Digital Arts Campus to the east and transit at Science World. Boutiques, pubs, indie shops and a lot of good food shape this hip chilled residential hood and it\u0027s unique atmosphere. ARTISTS - You can create what you imagine!",
    "search_frequency": 0
  },
  {
    "id": "R2864108",
    "propertyName": "711 4028 KNIGHT STREET",
    "buildingType": "Apartment",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V5N5Y8",
    "price": 519000,
    "bedrooms": 0,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 506.0,
    "description": "Welcome to this extremely functional 506 SF studio home with potential to turn into a one bedroom. Located on the QUIET side of the building looking into the courtyard, this home features updated laminate floors, light fixtures, bathtub glass, and updated appliances; fridge, oven, dishwasher, and washer/dryer. The BUILDING: Solid concrete building built by Aquilini Group features a large fitness room, party room \u0026 on-site caretaker. The LOCATION: Only 15 mins to Richmond, Downtown Vancouver \u0026 Metrotown. Save on Foods, Public library, TD Bank and boutique shops all within walking distance. The home comes with 1 parking \u0026 1 locker included and the building is Pet friendly and Rentals allowed! Great Investment or 1st time home buyer.",
    "search_frequency": 0
  },
  {
    "id": "R2864093",
    "propertyName": "2405 838 W HASTINGS STREET",
    "buildingType": "Apartment",
    "city": "Vancouver",
    "province": "British Columbia",
    "pincode": "V6C0A6",
    "price": 1225000,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 0.0,
    "sqft": 1027.0,
    "description": "The epitome of upscale urban living at Jameson House. Meticulously crafted by esteemed architect Norman Foster, this 1027 sqft residence comprises 2 beds \u0026 2 baths. Positioned on the NW corner, it presents breathtaking vistas of the mountains, city skyline, and glimpses of the water. Designed for seamless living, the open floor plan is accentuated by premium finishings. The kitchen is adorned with sleek cabinets from DADA Italy, complemented by high-end appliances courtesy of Gaggenau and Sub Zero, and adorned with exquisite Italian travertine floors. Experience unparalleled convenience and security with a 24-hour concierge service and an automated valet parking system. Ample bicycle storage ensures both accessibility and safety for city living. Discover the pinnacle of luxury living.",
    "search_frequency": 0
  },
  {
    "id": "202405732",
    "propertyName": "1814 Chestnut Street",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B3H3T8",
    "price": 884900,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 3.0,
    "sqft": 1813.0,
    "description": "Close to great schools and just steps away from the local business and shopping district of Quinpool Rd, this centrally located South End home is perfectly positioned to enjoy everything Halifax peninsula offers. The main level features a flowing layout with a sunroom, living room, and dining room off of the kitchen which looks out into the private, manicured back garden. The second floor contains 3 large bedrooms for the kids with ample storage space throughout while the upper floor provides a private primary bedroom. The partially finished basement provides excellent clean storage space as is and is well suited for a lift for a family looking to expand their space in the future. Set up your workshop in the attached garage and protect your vehicles from our Nova Scotia winters. Being within walking distance of Dalhousie, hospitals, and downtown offices makes this home an excellent choice for a wide variety of buyers who will profit from the accelerating growth of adjacent neighborhoods while the ER-2",
    "search_frequency": 0
  },
  {
    "id": "202405731",
    "propertyName": "507 60 Walter Havill Drive",
    "buildingType": "Apartment",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B3N0A9",
    "price": 469900,
    "bedrooms": 2,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 1035.0,
    "description": "Welcome to the Waterton Condominiums! Discover unparalleled luxury in this exquisite two-bedroom, two-bathroom unit boasting breathtaking views of Long Lake Provincial Park from your private balcony. Location is everything, with this centrally located open-concept gem in Halifax. Just around the corner from the highway, and less than a 10-minute drive from the vibrant downtown core, Halifax Shopping Centre, and all your essential amenities, convenience is at your fingertips. Inside, indulge in the comforts of home with a primary ensuite bathroom featuring double vanities, a standing shower, and a sprawling walk-in closet?a true retreat in comfort and style. The second bedroom offers ample space, ensuring your guests feel right at home, while the guest bathroom invites relaxation with its luxurious tub and picturesque views of Long Lake Park. Effortlessly entertain in the smartly designed galley kitchen, seamlessly integrated into the open-concept layout, with modern amenities and ample storage. Adjacent, the dedicated dining space provides an inviting ambiance for hosting gatherings with friends and family. Step outside onto the expansive deck and immerse yourself in outdoor living, with panoramic views of Long Lake Provincial Park, enhancing the allure of this luxurious retreat. Experience the epitome of luxury living at the Waterton Condominiums?a harmonious blend of sophistication, convenience, and natural beauty awaits.",
    "search_frequency": 0
  },
  {
    "id": "202405730",
    "propertyName": "78 Howe Avenue",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B2T1H7",
    "price": 400900,
    "bedrooms": 3,
    "bathrooms": 2,
    "numberOfStoreys": 1.0,
    "sqft": 1255.0,
    "description": "Find yourself living in Fall River living in Schwartzwald subdivision, a mature neighborhood. This craftsman built bungalow has been lovingly lived in for the past 24 years. It has the advantage of being wheelchair accessible and has handicapped features for those that may need them. Situated on a gradual sloping landscaped lot with a rear level walkout, a children\u0027s swings and playground set and a stand of hemlock trees at the back of the home. Upon entering the horseshoe shaped driveway you will enter onto a 42 foot front deck that faces west and street side. This home has 2 bedrooms and baths upstairs and the kitchen, dining room and living room. Downstairs has one bedroom plus the opportunity to finish a den, a workshop, the laundry and 3rd bath plus another bedroom as they are all framed up awaiting drywall. Upstairs master bedroom on-suite features a wheel chair accessible shower with laundry, recently renovated. The home features a handicapped elevator. This desired neighborhood is full of amenities. School here has the desired Holland road elementary with the high school being Lockview, of course French immersion at most levels. Recreation services abound here, whether volunteer or bought. Lakes in the area are on the Shubenacadie Grand Lake water system and there is always an open source for all seasons recreation. Parks, trails and golf are near by as well. Conveniently located the international airport, the 100 series highways to Bedford Sackville Burnside and downtown venues. Fall River has shopping, restaurants and many professional services here. A home that is a little dated and needing some TLC, live here and let your imagination and flare complete the home the way you dream. HRM will allow a granny suite or a separate detached residence.",
    "search_frequency": 0
  },
  {
    "id": "202405728",
    "propertyName": "22864 Highway 7",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B0J3B0",
    "price": 299990,
    "bedrooms": 6,
    "bathrooms": 6,
    "numberOfStoreys": 3.0,
    "sqft": 2510.0,
    "description": "Located in the heart of Sheet Harbour, this 6 bedroom and 6 ensuite bathroom house is perfect for a large family! There is a separate entrance for one of the bedrooms which has its own personal suite, which includes a kitchen, bathroom \u0026 large outdoor deck. The property sits on 6.15 acres of land and has the potential for many uses, such as a hobby farm, income property, B\u0026B, AirBnB and more! Bonus: The attic space has potential to be renovated to add an additional room with a bathroom. This property is close to lots of amenities such as schools, grocery store, NSLC, hospital, pharmacy and more. The property as is being sold \\\"as it, where is.\\\"",
    "search_frequency": 0
  },
  {
    "id": "202405724",
    "propertyName": "122 45 Vimy Avenue",
    "buildingType": "Apartment",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B3M4C5",
    "price": 429000,
    "bedrooms": 1,
    "bathrooms": 1,
    "numberOfStoreys": 1.0,
    "sqft": 1041.0,
    "description": "Visit REALTOR� website for additional information. Granbury Place is close to highways, shopping, dining, recreation centers, Mount Saint Vincent University and just minutes from downtown Halifax. Pub1ic Transit is accessible from Lacewood Drive. Onsite gym available for tenants and owners. This open concept unit with 1 Bedroom, 1 Full Bath was recently renovated with granite countertops, modern cupboards, LED \u0026 track lighting, new flooring throughout and a new hot water tank. Spacious bedroom with his \u0026 her closets, in unit all-in-one washer/dryer, plus a full storage room. Well maintained building with onsite superintendent. Excellent rental income for those looking for an investment property. With over 1000 sq. ft. of living space this condo offers elegance, style and space. Book your showing today!",
    "search_frequency": 0
  },
  {
    "id": "202405721",
    "propertyName": "18 Sugar Maple Drive",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B3T1G3",
    "price": 359900,
    "bedrooms": 4,
    "bathrooms": 3,
    "numberOfStoreys": 2.0,
    "sqft": 1980.0,
    "description": "Solid home with loads of potential and great location. This 4 bedroom 2.5 bath property has the size and square footage to make a great family home. Finished over three levels, this quintessential Timberlea semi has a great layout with large living room, separate dining and kitchen as well as a 2 pce powder room on the main level. There are patio doors off the dining room leading to a large deck and good sized fenced yard. The side door off the driveway gives you great access to the kitchen and basement. Upstairs you?ll find three spacious bedrooms including a primary bedroom with a walk-in closet and a cheat suite door to the main 4 pce bath. The lower level has loads of potential with a three piece bath and laundry, bedroom and family room. Most of the flooring is original and in need of replacement however most windows were replaced in 2014, roof shingles 2010, new front porch 2023, ductless heat pump 2017 and hot water tank 2018. This home is being sold ?as is where is? since current sellers have never lived in the property. This home is close to schools, walking trails, parks and shopping with great bus links. The inside walls have been primed and the house is ready for your finishing touches.",
    "search_frequency": 0
  },
  {
    "id": "202405719",
    "propertyName": "Back Bay Road",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "N3T1Y1",
    "price": 375000,
    "bedrooms": 2,
    "bathrooms": 1,
    "numberOfStoreys": 0.0,
    "sqft": 0.0,
    "description": "Special Parcel of Land for sale with valuable. 2 Approved Building Lots with a total of 250ft ocean frontage. Only 25km from Halifax.",
    "search_frequency": 0
  },
  {
    "id": "202405711",
    "propertyName": "92 Todds Island Road",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B3Z2C7",
    "price": 1100000,
    "bedrooms": 4,
    "bathrooms": 2,
    "numberOfStoreys": 2.0,
    "sqft": 2446.0,
    "description": "If the perfect amalgamation of oceanfront living, quality craftsmanship, and a tranquil setting are on your list - 92 Todds Island Road is ready to welcome you home! Set on the idyllic and private Todds Island your new property offers 170\u0027 of accessible oceanfront with a dock, a beautifully maintained chalet inspired 4 bedroom + 2 bath main house, a full season 2 bedroom + 1 bath guest house, and two well appointed outbuildings. The main house features a functional layout as you enter through your foyer with ocean views catching your eye as you look through the laundry and kitchen spaces into the dining nook and living room. Enjoy the coziness of the wood burning fireplace and ductless heating/cooling as you admire the views out of the long wall of windows. Heading to the second floor you\u0027re offered a 4 piece bathroom and a nicely sized den \u0026 office space. The primary suite of all primary suites offers the most tranquil setting with stunning ocean views whether you\u0027re enjoying it from bed next to the second wood burning fireplace, your own seating area, or out on your private balcony. Two generously sized bedrooms and another 4 piece bathroom finish off the space. Your lower level walkout basement offers a wonderful bonus room with sauna, large bedroom, and generous space for storage. If you need even more storage, you have the choice between the double detached garage or recently built out-building off the second driveway. Take a peaceful stroll to your private full season guest house which offers just under 750sqft of living space and features character rich details throughout the 2 bedrooms and 1 full bathroom. This home has been incredibly well maintained with a upgrades including roof",
    "search_frequency": 0
  },
  {
    "id": "202405712",
    "propertyName": "60 Marron Lane",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B4E0M7",
    "price": 999900,
    "bedrooms": 4,
    "bathrooms": 4,
    "numberOfStoreys": 2.0,
    "sqft": 3424.0,
    "description": "Welcome to 60 Marron Lane, a gorgeous 10 months young home, nestled on 1.2 acres of land within the desirable Indigo Shores subdivision. Enjoy the luxury of public lake access and the convenience of being minutes away from the highway and local amenities! This two-storey haven boasts 4 bedrooms plus den and flex room, along with 3.5 bathrooms, and an expansive 3,424 sqft of living space! When you enter through the spacious front foyer, 9ft ceilings welcome you to the main level, and flow into the grand two-storey living room with a floor-to-ceiling shiplap propane fireplace. The main living space seamlessly transitions into an open-concept dining area and large L-shaped kitchen, featuring cabinets to the ceiling, a corner pantry, and a generous island. Step through the sliding patio doors to the expansive back deck, offering an ideal space for outdoor entertainment, complete with stairs leading down to the yard. Completing the main level with a spacious home office room",
    "search_frequency": 0
  },
  {
    "id": "202405700",
    "propertyName": "277 Paddys Head Road",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B3Z3N7",
    "price": 1699000,
    "bedrooms": 4,
    "bathrooms": 3,
    "numberOfStoreys": 1.0,
    "sqft": 2219.0,
    "description": "Perched majestically on the rugged coastline of Indian Harbor, this 2020-built oceanfront masterpiece is a testament to refined coastal living. With over 250 feet of unobstructed ocean views, this residence offers an unparalleled retreat from the hustle and bustle of everyday life. The main house, boasting three bedrooms and two full baths. From the moment you step inside, you are greeted by an atmosphere of tranquility and luxury. The open-concept design seamlessly blends the living, dining, and kitchen areas, creating an ideal space for both intimate gatherings and grand entertaining. The kitchen, equipped with outstanding appliances and custom cabinetry, is a chef?s dream. While the adjoining living room, with its cozy fireplace and breathtaking views, is the perfect place to unwind after a long day. The primary suite offers a private sanctuary where relaxation is paramount with an ensuite bathroom, complete with a walk-in shower to ensure the utmost comfort and luxury. Two additional bedrooms, each thoughtfully appointed and tastefully furnished, provide ample space for family and guests. But perhaps the most enticing feature of this property is the addition of a separate guest suite, located to the left of the main house. With its own entrance and amenities, including a full bathroom and kitchenette, this charming retreat offers endless possibilities for hosting friends and family or generating additional income through short-term rentals. Outside, the grounds are a dream with meandering pathways, and a secluded patio overlooking the ocean. A private water access on the inlet it allows you to enjoy the crystal-clear ocean, perfect for swimming, kayaking, or simply enjoying the sun. Located just 15 minutes from the community of St Margaret?s Bay and a short drive from downtown Halifax, this oceanfront estate offers the perfect blend of seclusion and convenience. Whether you?re seeking a peaceful retreat or an adventurous getaway, this property has it all.",
    "search_frequency": 0
  },
  {
    "id": "202405697",
    "propertyName": "150 Terradore Lane",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B4B1S7",
    "price": 829900,
    "bedrooms": 4,
    "bathrooms": 4,
    "numberOfStoreys": 2.0,
    "sqft": 2883.0,
    "description": "Stonewater Homes presents the \\\"Terra\\\" home plan in newest phase of the highly sought-after community of West Bedford. This 4 bedroom, 3.5 bathroom home has much to offer. The main floor is an open concept design inclusive of a large family room with a fireplace and home office/den that is perfect for those who work from home. The kitchen features cabinetry extended to the ceiling, quartz countertops in kitchen, and a large walk-in pantry. The dining room has large sliding glass doors leading to the back deck and lovely back yard space. The main floor also features a mudroom entry with high ceilings and built-in lockers. There are three bedrooms on the upper floor including a large primary bedroom with walk-in closet and ensuite including dual vanities, custom tiled shower, and soaker tub. The fully finished walkout basement offers a family room, 4th bedroom, and full bathroom. Other notable features include an attached garage, electric heat with ductless heat pump on main level, hardwood staircases, laminate flooring throughout, full landscaping, and paved driveway. Personalize this home with your own finish selections. Call today!",
    "search_frequency": 0
  },
  {
    "id": "202405698",
    "propertyName": "146 Terradore Lane",
    "buildingType": "House",
    "city": "Halifax",
    "province": "Nova Scotia",
    "pincode": "B4B1S7",
    "price": 829900,
    "bedrooms": 4,
    "bathrooms": 4,
    "numberOfStoreys": 2.0,
    "sqft": 2883.0,
    "description": "Stonewater Homes presents the \\\"Terra\\\" home plan in newest phase of the highly sought-after community of West Bedford. This 4 bedroom, 3.5 bathroom home has much to offer. The main floor is an open concept design inclusive of a large family room with a fireplace and home office/den that is perfect for those who work from home. The kitchen features cabinetry extended to the ceiling, quartz countertops in kitchen, and a large walk-in pantry. The dining room has large sliding glass doors leading to the back deck and lovely back yard space. The main floor also features a mudroom entry with high ceilings and built-in lockers. There are three bedrooms on the upper floor including a large primary bedroom with walk-in closet and ensuite including dual vanities, custom tiled shower, and soaker tub. The fully finished walkout basement offers a family room, 4th bedroom, and full bathroom. Other notable features include an attached garage, electric heat with ductless heat pump on main level, hardwood staircases, laminate flooring throughout, full landscaping, and paved driveway. Personalize this home with your own finish selections. Call today!",
    "search_frequency": 0
  }
]